#Практическая работа 1.
**Студент:** Паринова Ксения Николаевна
**Группа:** 1зб_ИВТ(ускор)/25
**Дата:** 01.04.2026 

## Задание  1.1: Hello, World!
### Постановка задачи
Напишите программу, которая выводит на экран сообщение "Hello, World!".
### Список идентификаторов
| Имя | Тип | Описание |
|-----|-----|----------|
| — | — | Переменные не используются |
### Код программы
```c
#include <stdio.h>
int main(void) {
printf("Hello, World!\n");
return 0;
}
```
### Результаты работы
