#Практическая работа 1.
**Студент:** Паринова Ксения Николаевна
**Группа:** 1зб_ИВТ(ускор)/25
**Дата:** 01.04.2026 

## Задание 1.1: Hello с именем.
### Постановка задачи
Напишите программу, которая выводит на экран сообщение "Hello, <имя>. I am learning C programming.".
### Список идентификаторов
| — | — | Переменные не используются |
### Код программы
```c
#include <stdio.h>

int main(void) {
    printf("Hello!My name is Kseniia.\n I am learning C programming.");
    return 0;
}
```
### Результаты работы


---
## Задание 1.2: Сумма двух чисел
### Постановка задачи
Напишите программу, которая запрашивает два целых числа и выводит их сумму.
### Математическая модель
Сумма двух чисел вычисляется по формуле:
S=a+b
где $a$ и $b$ — введённые пользователем числа.
### Список идентификаторов
| Имя | Тип | Описание |
|-----|-----|----------|
| `a` | `int` | Первое число (ввод пользователя) |
| `b` | `int` | Второе число (ввод пользователя) |
| `sum`| `int`| Результат сложения |
### Код программы
```c
#include <stdio.h>

int main(void) {
    int a, b, sum;
    
    printf("Enter first number: ");
    scanf("%d", &a);
    
    printf("Enter second number: ");
    scanf("%d", &b);
    
    sum = a + b;
    
    printf("Sum: %d + %d = %d\n", a, b, sum);
    
    return 0;
}
```
### Результаты работы

---
## Задание 1.3: Произведение двух чисел
### Постановка задачи

}
```
### Результаты работы

---
## Задание 1.4: Площадь круга
### Постановка задачи

}
```
### Результаты работы

---
## Задание 1.5: Конвертер температуры
### Постановка задачи

}
```
### Результаты работы
