#Практическая работа 1.
**Студент:** Паринова Ксения Николаевна
**Группа:** 1зб_ИВТ(ускор)/25
**Дата:** 01.04.2026 

## Задание  1.1: Hello, World!
### Постановка задачи
Напишите программу, которая выводит на экран сообщение "Hello, World!".
### Список идентификаторов
| Имя | Тип | Описание |
|-----|-----|----------|
| — | — | Переменные не используются |
### Код программы
```c
#include <stdio.h>
int main(void) {
printf("Hello, World!\n");
return 0;
}
```
### Результаты работы
## Задание 1.2: Площадь круга
### Постановка задачи
Напишите программу, которая запрашивает радиус круга и вычисляет его площадь.
### Математическая модель
$$
S = \pi r^2
$$
### Список идентификаторов
| Имя | Тип | Описание |
|-----|-----|----------|
| `radius` | `double` | Радиус круга (ввод пользователя) |
| `area` | `double` | Вычисленная площадь |
### Код программы
```c
#include <stdio.h>
#define PI 3.14159265358979
int main(void) {
double radius, area;
printf("Введите радиус: ");
scanf("%lf", &radius);
area = PI * radius * radius;
printf("Площадь круга: %.2lf\n", area);
return 0;
}
```
### Результаты работы
## Задание 1.3: Площадь круга
### Постановка задачи
Напишите программу, которая запрашивает радиус круга и вычисляет его площадь.
### Математическая модель
$$
S = \pi r^2
$$
### Список идентификаторов
| Имя | Тип | Описание |
|-----|-----|----------|
| `radius` | `double` | Радиус круга (ввод пользователя) |
| `area` | `double` | Вычисленная площадь |
### Код программы
```c
#include <stdio.h>
#define PI 3.14159265358979
int main(void) {
double radius, area;
printf("Введите радиус: ");
scanf("%lf", &radius);
area = PI * radius * radius;
printf("Площадь круга: %.2lf\n", area);
return 0;
}
```
