#Практическая работа 1.
**Студент:** Паринова Ксения Николаевна
**Группа:** 1зб_ИВТ(ускор)/25
**Дата:** 01.04.2026 

## Задание 1.1: Hello с именем.
### Постановка задачи
Напишите программу, которая выводит на экран сообщение "Hello, <имя>. I am learning C programming.".
### Список идентификаторов
| — | — | Переменные не используются |
### Код программы
```c
#include <stdio.h>

int main(void) {
    printf("Hello!My name is Kseniia.\n I am learning C programming.");
    return 0;
}
```
### Результаты работы


---
## Задание 1.2: Сумма двух чисел
### Постановка задачи
Напишите программу, которая запрашивает два целых числа и выводит их сумму.
### Математическая модель
Сумма двух чисел вычисляется по формуле:
S=a+b
где $a$ и $b$ — введённые пользователем числа.
### Список идентификаторов
| Имя | Тип | Описание |
|-----|-----|----------|
| `a` | `int` | Первое число (ввод пользователя) |
| `b` | `int` | Второе число (ввод пользователя) |
| `sum`| `int`| Результат сложения |
### Код программы
```c
#include <stdio.h>

int main(void) {
    int a, b, sum;
    
    printf("Enter first number: ");
    scanf("%d", &a);
    
    printf("Enter second number: ");
    scanf("%d", &b);
    
    sum = a + b;
    
    printf("Sum: %d + %d = %d\n", a, b, sum);
    
    return 0;
}
```
### Результаты работы

---
## Задание 1.3: Произведение двух чисел
### Постановка задачи
Напишите программу, которая запрашивает два целых числа и выводит их произведение.
### Математическая модель
Произведение двух чисел вычисляется по формуле:
P=a×b
где $a$ и $b$ — введённые пользователем числа.
### Список идентификаторов
| Имя | Тип | Описание |
|-----|-----|----------|
| `a` | `int` | Первое число (ввод пользователя) |
| `b` | `int` | Второе число (ввод пользователя) |
| `product`| `int`| Результат умножения |
### Код программы
```c
#include <stdio.h>

int main(void) {
    int a, b, product;

    printf("Enter first number: ");
    scanf("%d", &a);

    printf("Enter second number: ");
    scanf("%d", &b);

    product = a * b;

    printf("Product: %d * %d = %d\n", a, b, product);

    return 0;
}
```
### Результаты работы

---
## Задание 1.4: Площадь круга
### Постановка задачи
Напишите программу, которая запрашивает радиус круга и вычисляет его площадь.
### Математическая модель
Площадь круга вычисляется по формуле:
S=πr^2
где $r$ — радиус круга, $\pi \approx 3.14159$.
### Список идентификаторов
| Имя | Тип | Описание |
|-----|-----|----------|
| `radius` | `double` | Радиус круга (ввод пользователя) |
| `area` | `double` | Вычисленная площадь круга |
### Код программы
```c
#include <stdio.h>

int main(void) {
    double radius, area;

    printf("Enter radius: ");

    scanf("%lf", &radius);

    area = 3.14159 * radius * radius;

    printf("Area: %.2lf\n", area);

    return 0;
}  
```
### Результаты работы
---
## Задание 1.5: Конвертер температуры
### Постановка задачи
Напишите программу, которая переводит температуру из градусов Цельсия в градусы Фаренгейта.
### Математическая модель
Перевод температуры выполняется по формуле:
F=C×9/5+32
где $C$ — температура в градусах Цельсия, $F$ — температура в градусах Фаренгейта.
### Список идентификаторов
| Имя | Тип | Описание |
|-----|-----|----------|
| `cels` | | Температура в градусах Цельсия (ввод пользователя) |
| `farin` | | Температура в градусах Фаренгейта (результат) |
### Код программы
```c
#include <stdio.h>

int main(void) {
    int cels, farin;

    printf("Enter temperature in Celsius: ");
    scanf("%d", &cels);

    farin = cels * 1.8 + 32;

    printf("Temperature in Fahrenheit: %d\n", farin);

    return 0;
}  
```
### Результаты работы
